index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-12 Thu 10:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sequent1</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="asset/css/index.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
<div id="content">
<h1 class="title">sequent1</h1>
<hr  />

<ul class="org-ul">
<li><p>a prototype interpreter of a lovely functional language</p><p>which uses sequent calculus as its dependent type system</p><p>the main idea is that</p><p>functions compose and types cut</p></li>

<li><p><a href="./sequent1.html">the implementation</a> written in scheme</p></li>

<li><p><a href="./example.html">example code</a></p><p>examples are learned from <a href="http://www.cs.cmu.edu/~drl/teaching/oplss13/">a course about agda</a> at <a href="https://www.cs.uoregon.edu/research/summerschool/summer13/curriculum.html">OPLSS 2013</a></p></li>

<li><p>(todo) paper for <a href="http://scheme2016.snow-fort.org/">scheme workshop 2016</a></p><p>(todo) demo for the talk</p></li>

<li><p><a href="https://github.com/xieyuheng/sequent1">source code</a> on github</p></li>

<li><p><a href="http://xieyuheng.github.io/">XIE Yuheng</a> created</p></li></ul>

<hr  />
</div>
<div id="postamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
</body>
</html>
